#ifndef __GAME_DEF_H_
#define __GAME_DEF_H_

#include <string>
#include "DInput.h"
const int CURRENT_VERSION = 1068; // 현재 버전

const float PACKET_INTERVAL_MOVE = 1.5f;				// 정기적으로 보내는 패킷 시간 간격..
const float PACKET_INTERVAL_ROTATE = 4.0f;
const float PACKET_INTERVAL_REQUEST_TARGET_HP = 2.0f;

// 단축키 지정해 놓은 부분..
enum eKeyMap {	KM_HOTKEY1 = DIK_1, 
				KM_HOTKEY2 = DIK_2, 
				KM_HOTKEY3 = DIK_3, 
				KM_HOTKEY4 = DIK_4, 
				KM_HOTKEY5 = DIK_5, 
				KM_HOTKEY6 = DIK_6, 
				KM_HOTKEY7 = DIK_7, 
				KM_HOTKEY8 = DIK_8, 
				KM_TOGGLE_RUN = DIK_T, 
				KM_TOGGLE_MOVE_CONTINOUS = DIK_E, 
				KM_TOGGLE_ATTACK = DIK_R, 
				KM_TOGGLE_SITDOWN = DIK_C, 
				KM_TOGGLE_INVENTORY = DIK_I, 
				KM_TOGGLE_SKILL = DIK_K, 
				KM_TOGGLE_STATE = DIK_U, 
				KM_TOGGLE_MINIMAP = DIK_M, 
				KM_TOGGLE_HELP = DIK_F1, 
				KM_CAMERA_CHANGE = DIK_F9, 
				KM_DROPPED_ITEM_OPEN = DIK_F, 
				KM_MOVE_FOWARD = DIK_W, 
				KM_MOVE_BACKWARD = DIK_S, 
				KM_ROTATE_LEFT = DIK_A, 
				KM_ROTATE_RIGHT = DIK_D, 
				KM_TARGET_NEARST_ENEMY = DIK_Z, 
				KM_TARGET_NEARST_PARTY = DIK_X, 
				KM_TARGET_NEARST_FRIEND = DIK_V, 
				KM_TARGET_PARTY1 = DIK_F1, 
				KM_TARGET_PARTY2 = DIK_F2, 
				KM_TARGET_PARTY3 = DIK_F3, 
				KM_TARGET_PARTY4 = DIK_F4, 
				KM_TARGET_PARTY5 = DIK_F5, 
				KM_TARGET_PARTY6 = DIK_F6, 
				KM_TARGET_PARTY7 = DIK_F7, 
				KM_TARGET_PARTY8 = DIK_F8 };

enum e_PlayerType { PLAYER_BASE = 0, PLAYER_NPC = 1, PLAYER_OTHER = 2, PLAYER_MYSELF = 3 };

enum e_Race {	RACE_ALL = 0,

						ITEM_CLASS_SHIELD_PLATE, // 15 : 플레이트쉴드(plateshield)
						
						ITEM_CLASS_BOW_SHORT = 21, // 21 : 쇼트보우(Shortbow)
						ITEM_CLASS_BOW_WRAPT, // 22 : 랩트보우(wraptbow)
						ITEM_CLASS_BOW_COMPOSITE, // 23 : 콤포지트보우(compositebow)
						ITEM_CLASS_BOW_IRON, // 24 : 아이언보우(ironbow)
						ITEM_CLASS_BOW_LONG, // 25 : 롱보우(longbow)
						ITEM_CLASS_BOW_CROSS, // 28 : 크로스보우(crossbow)
						
						ITEM_CLASS_STAFF = 31, // 31 : 지팡이(staff)
						ITEM_CLASS_ETC, // 32 : 기타 마법 물품
						
						ITEM_CLASS_ARMOR_COTTON = 41, // 41 : 천방어구(cotton)
						ITEM_CLASS_ARMOR_FUR, // 42 : 털가죽(Fur)
						ITEM_CLASS_ARMOR_LEATHER, // 43 : 가죽방어구(leather)
						ITEM_CLASS_ARMOR_HADLEATHER, // 44 : 하드레더방어구(hardleather)
						ITEM_CLASS_ARMOR_RINGMAIL, // 45 : 링방어구(ringmail)
						ITEM_CLASS_ARMOR_SCALEMAIL, // 46 : 비늘방어구(scaledmail)
						ITEM_CLASS_ARMOR_HALFPLATE, // 47 : 하프 플레이트 방어구
						ITEM_CLASS_ARMOR_FULLPLATE, // 48 : 철판방어구(platemail)
						ITEM_CLASS_ROBE, // 49 : 마법사로브(robe)
						
						ITEM_CLASS_ARROW = 101,
						
						ITEM_CLASS_UNKNOWN = 0xffffffff }; // 101: 화살(arrow) 
*/
enum e_ItemAttrib	{
						ITEM_ATTRIB_GENERAL = 0,
						ITEM_ATTRIB_MAGIC	= 1,
						ITEM_ATTRIB_LAIR	= 2,
						ITEM_ATTRIB_CRAFT	= 3,
						ITEM_ATTRIB_UNIQUE	= 4,
						ITEM_ATTRIB_UPGRADE	= 5,		
						ITEM_ATTRIB_UNKNOWN = 0xffffffff };	

enum e_ItemClass	{	ITEM_CLASS_DAGGER = 11, // 단검(dagger)
						ITEM_CLASS_SWORD = 21, // 한손검(onehandsword)
						ITEM_CLASS_SWORD_2H = 22, // 3 : 양손검(twohandsword)
						ITEM_CLASS_AXE = 31, // 한손도끼(onehandaxe)
						ITEM_CLASS_AXE_2H = 32, // 두손도끼(twohandaxe)
						ITEM_CLASS_MACE = 41, // 한손타격무기(mace)
						ITEM_CLASS_MACE_2H = 42, // 두손타격무기(twohandmace)
						ITEM_CLASS_SPEAR = 51, // 창(spear)
						ITEM_CLASS_POLEARM = 52, // 폴암(polearm)
						
						ITEM_CLASS_SHIELD = 60, // 쉴드(shield)

						ITEM_CLASS_BOW = 70, //  쇼트보우(Shortbow)
						ITEM_CLASS_BOW_CROSS = 71, // 크로스보우(crossbow)
						ITEM_CLASS_BOW_LONG = 80, // 롱보우(longbow)

						ITEM_CLASS_EARRING = 91, // 귀걸이
						ITEM_CLASS_AMULET = 92, // 목걸이
						ITEM_CLASS_RING = 93, // 반지
						ITEM_CLASS_BELT = 94, // 허리띠
						ITEM_CLASS_CHARM = 95, //인벤토리에 지니고 있는 아이템
						ITEM_CLASS_JEWEL = 96, //보석종류
						ITEM_CLASS_POTION = 97, // 물약
						ITEM_CLASS_SCROLL = 98, // 스크롤

						ITEM_CLASS_LAUNCHER = 100, // 창던질때 쓰는 아이템..
						
						ITEM_CLASS_STAFF = 110, // 지팡이(staff)
						ITEM_CLASS_ARROW = 120, // 화살(Arrow)
						ITEM_CLASS_JAVELIN = 130, // 투창
						
						ITEM_CLASS_ARMOR_WARRIOR = 210, // 전사 방어구
						ITEM_CLASS_ARMOR_ROGUE = 220, // 로그 방어구
						ITEM_CLASS_ARMOR_MAGE = 230, // 마법사 방어구
						ITEM_CLASS_ARMOR_PRIEST = 240, // 사제 방어구

						ITEM_CLASS_ETC = 251, // 기타

						ITEM_CLASS_UNKNOWN = 0xffffffff }; // 

enum e_Nation { NATION_NOTSELECTED = 0, NATION_KARUS, NATION_ELMORAD, NATION_UNKNOWN = 0xffffffff };

struct __TABLE_ITEM_BASIC;
struct __TABLE_ITEM_EXT;
struct __TABLE_PLAYER;

enum e_Authority { AUTHORITY_MANAGER = 0, AUTHORITY_USER, AUTHORITY_NOCHAT, AUTHORITY_NPC, AUTHORITY_BLOCK_USER = 0xff };

struct __InfoPlayerBase
{
	int			iID;			// 고유 ID
	std::string szID;			// 이름
	D3DCOLOR	crID;			// 이름 색깔..
	e_Race		eRace;			// 캐릭터 골격에 따른 종족
	e_Nation	eNation;		// 소속 국가..
	e_Class		eClass;			// 직업
	int			iLevel;			// 레벨
	int			iHPMax;	
	int			iHP; 
	int			iAuthority;		// 권한 - 0 관리자, 1 - 일반유저, 255 - 블럭당한 유저...

	bool		bRenderID;		// 화면에 ID 를 찍는지..

	void Init()
	{
		iID = 0;					// 고유 ID
		szID = "";					// 이름
		crID = 0;					// 이름 색깔..
		eRace = RACE_UNKNOWN;		// 캐릭터 골격에 따른 종족
		eNation = NATION_UNKNOWN;	// 소속 국가..
		eClass = CLASS_UNKNOWN;		// 직업
		iLevel = 0;					// 레벨
		iHPMax = 0;	
		iHP = 0; 
		iAuthority = 1;				// 권한 - 0 관리자, 1 - 일반유저, 255 - 블럭당한 유저...
		bRenderID = true;
	}
};

struct __InfoPlayerOther
{
	int			iFace;			// 얼굴 모양..
	int			iHair;			// 머리카락 모양..

	int			iCity;			// 소속도시
	int			iKnightsID;		// 소속 기사단(길드) ID
	std::string szKnights;		// 소속 기사단(길드) 이름
	int			iKnightsGrade;	// 소속 기사단(길드) 등급
	int			iKnightsRank;	// 소속 기사단(길드) 순위

	int			iRank;			// 작위 - 백작, 공작 - 권한에 따른 분류
	int			iTitle;			// 직위 - 영주, 성주 - 단순한 신분 -> 길드장...

	void Init()
	{
		iFace = 0;			// 얼굴 모양..
		iHair = 0;			// 머리카락 모양..
		iCity;				// 소속도시
		iKnightsID = 0;		// 소속 기사단(길드)
		szKnights = "";		// 소속 기사단(길드)
		iKnightsGrade = 0;		// 소속 기사단(길드) 색깔
		iKnightsRank = 0;			// 작위 - 백작, 공작 - 권한에 따른 분류
		iTitle = 0;			// 직위 - 영주, 성주 - 단순한 신분 -> 길드장...
	}
};

// 기사단 직위..
enum e_KnightsDuty {	KNIGHTS_DUTY_UNKNOWN = 0,		// ????? 쫓겨남??
						KNIGHTS_DUTY_CHIEF = 1,			// 단장
						KNIGHTS_DUTY_VICECHIEF = 2,		// 부단장 
						KNIGHTS_DUTY_PUNISH = 3,		// 징계중.
						KNIGHTS_DUTY_TRAINEE = 4,		// 견습기사
						KNIGHTS_DUTY_KNIGHT = 5,		// 일반기사
						KNIGHTS_DUTY_OFFICER = 6		// 장교
					};

#define VICTORY_ABSENCE		0
#define VICTORY_KARUS		1
#define VICTORY_ELMORAD		2

struct __InfoPlayerMySelf : public __InfoPlayerOther
{
	int					iBonusPointRemain; // 남는 보너스 포인트...
	int					iLevelPrev; // 직전의 레벨...

	int					iMSPMax; 
	int					iMSP; 
			
	int					iTargetHPPercent;
	int					iGold;
	int					iExpNext;
	int					iExp; 
	int					iRealmPoint;		// 국가 기여도
	e_KnightsDuty		eKnightsDuty;		// 기사단 권한
	int					iWeightMax;			// 아이템의 총무게
	int					iWeight;			// 들수 있는 아이템 무게..
	int					iStrength;			// 힘
	int					iStrength_Delta;		// 아이템이나 마법에 의해 가감된값.
	int					iStamina;			// 스테미너
	int					iStamina_Delta;		// 아이템이나 마법에 의해 가감된값.
	int					iDexterity;			// 민첨성..
	int					iDexterity_Delta;	// 아이템이나 마법에 의해 가감된값.
	int					iIntelligence;		// 지능
	int					iIntelligence_Delta; // 아이템이나 마법에 의해 가감된값.
	int 				iMagicAttak;		// 마력
	int 				iMagicAttak_Delta;	// 아이템이나 마법에 의해 가감된값.
	
	int 				iAttack;		// 공격력
	int 				iAttack_Delta;	// 마법에 의해 가감된 값..
	int 				iGuard;			// 방어력
	int 				iGuard_Delta;	// 마법에 의해 가감된 값..

	int 				iRegistFire;			// 저항력
	int 				iRegistFire_Delta;		// 마법에 의한 저항력 변화값..
	int 				iRegistCold;			// 저항력
	int 				iRegistCold_Delta;		// 마법에 의한 저항력 변화값..
	int 				iRegistLight;			// 저항력
	int 				iRegistLight_Delta;		// 마법에 의한 저항력 변화값..
	int 				iRegistMagic;			// 저항력
	int 				iRegistMagic_Delta;		// 마법에 의한 저항력 변화값..
	int 				iRegistCurse;			// 저항력
	int 				iRegistCurse_Delta;		// 마법에 의한 저항력 변화값..
	int 				iRegistPoison;			// 저항력
	int 				iRegistPoison_Delta;	// 마법에 의한 저항력 변화값..

	int					iZoneInit;				// 서버한테 처음에 받은 존번호
	int					iZoneCur;				// 현재 존..
	int					iVictoryNation;			// 0: 무승부 1:엘모라드 승리 2:카루스 승리

	void Init()
	{
		__InfoPlayerOther::Init();

		iBonusPointRemain = 0; // 남는 보너스 포인트...
		iLevelPrev = 0; // 직전의 레벨...

		iMSPMax = 0; 
		iMSP = 0; 
		
		iTargetHPPercent = 0;
		iGold = 0;
		iExpNext = 0;
		iExp = 0; 
		iRealmPoint = 0;		// 국가 기여도
		eKnightsDuty = KNIGHTS_DUTY_UNKNOWN;		// 기사단 권한
		iWeightMax = 0;			// 아이템의 총무게
		iWeight = 0;			// 들수 있는 아이템 무게..
		iStrength = 0;			// 힘
		iStrength_Delta = 0;	// 아이템이나 마법에 의해 가감된값.
		iStamina = 0;			// 스테미너
		iStamina_Delta = 0;		// 아이템이나 마법에 의해 가감된값.
		iDexterity = 0;			// 민첨성..
		iDexterity_Delta = 0;	// 아이템이나 마법에 의해 가감된값.
		iIntelligence = 0;		// 지능
		iIntelligence_Delta = 0; // 아이템이나 마법에 의해 가감된값.
		iMagicAttak = 0;		// 마력
		iMagicAttak_Delta = 0;	// 아이템이나 마법에 의해 가감된값.
		
		iAttack = 0;		// 공격력
		iAttack_Delta = 0;	// 마법에 의해 가감된 값..
		iGuard = 0;			// 방어력
		iGuard_Delta = 0;	// 마법에 의해 가감된 값..

		iRegistFire = 0;			// 저항력
		iRegistFire_Delta = 0;		// 마법에 의한 저항력 변화값..
		iRegistCold = 0;			// 저항력
		iRegistCold_Delta = 0;		// 마법에 의한 저항력 변화값..
		iRegistLight = 0;			// 저항력
		iRegistLight_Delta = 0;		// 마법에 의한 저항력 변화값..
		iRegistMagic = 0;			// 저항력
		iRegistMagic_Delta = 0;		// 마법에 의한 저항력 변화값..
		iRegistCurse = 0;			// 저항력
		iRegistCurse_Delta = 0;		// 마법에 의한 저항력 변화값..
		iRegistPoison = 0;			// 저항력
		iRegistPoison_Delta = 0;	// 마법에 의한 저항력 변화값..

		iZoneInit = 0x01;			// 서버한테 처음에 받은 존번호
		iZoneCur = 0;				// 현재 존..
		iVictoryNation = -1;		// 전쟁에서 이긴 국가
	}
};

const int MAX_PARTY_OR_FORCE = 8;

struct __InfoPartyOrForce
{
	int			iID;			// 파티원 ID
	int			iLevel;			// Level
	e_Class		eClass;			// 직업
	int			iHP;			// Hit Point
	int			iHPMax;			// Hit Point Max
	bool		bSufferDown_HP;			// Status - HP 떨어짐...
	bool		bSufferDown_Etc;		// Status - 저주계열 영향을 받을때
	std::string szID;		// 파티 이름 문자열

	void Init()
	{
		iID = -1;
		iLevel = 0;
		eClass = CLASS_UNKNOWN;
		iHP = 0;
		iHPMax = 0;
		szID = "";

		bSufferDown_HP = false;			// Status - HP 떨어짐...
		bSufferDown_Etc = false;		// Status - 저주계열 영향을 받을때
	};

	__InfoPartyOrForce()
	{
		this->Init();
	}
};

enum e_PartyStatus { PARTY_STATUS_DOWN_HP = 1, PARTY_STATUS_DOWN_ETC = 2 };

struct __InfoPartyBBS // 파티 지원 게시판 구조체..
{
	std::string szID;			// 파티 이름 문자열
	int			iID;			// 파티원 ID
	int			iLevel;			// Level
	e_Class		eClass;			// 직업
	int			iMemberCount;

	void Init()
	{
		szID = "";
		iID = -1;
		iLevel = 0;
		eClass = CLASS_UNKNOWN;
		iMemberCount = 0;
	};

	__InfoPartyBBS()
	{
		this->Init();
	}
};

enum {	RESRC_UI_LOGIN = 0, RESRC_UI_CHARACTERSELECT, RESRC_UI_CHARACTERCREATE, RESRC_UI_INVENTORY, RESRC_UI_CHAT,
		RESRC_UI_MYINFORMATION, RESRC_UI_TARGET, RESRC_UI_HOTKEY, RESRC_UI_FUNCTION };

typedef struct __TABLE_ZONE
{
	DWORD		dwID; // zone ID
	std::string	szTerrainFN; // Terrain FileName - Terrain, Tile Map, ColorMap....
	std::string	szColorMapFN;
	std::string	szLightMapFN;
	std::string	szObjectPostDataFN; // Object 위치 정보 - 이안에 충돌 체크 데이터도 들어 있다.
	std::string	szMiniMapFN;
	std::string szSkySetting; // 하늘과 분위기 조정한 세팅 정보 파일..
	BOOL		bIndicateEnemyPlayer;	// 적국 플레이어를 표시하나??
	int			iFixedSundDirection;	// 해의 방향을 고정시키는지..
	std::string szLightObjFN;		// 지형에 배치되어 있는 라이트정보파일..
} TABLE_ZONE;

typedef struct __TABLE_UI_RESRC
{
	DWORD dwID;							// 플레이어의 소속 국가에 따른 키로 쓴다..

	std::string szLogIn;				// 0
	std::string szCmd;					// 1
	std::string szChat;					// 2
	std::string szMsgOutput;			// 3
	std::string szStateBar;				// 4
	std::string szVarious;				// 5 - 캐릭터 상태, 기사단 관리, 퀘스트, 친구.. 등등 네페이지가 한개에 들어있음.
	std::string szState;				// 6 - 캐릭터 상태
	std::string szKnights;				// 7 - 기사단 관리
	std::string szQuest;				// 8 - 퀘스트
	std::string szFriends;				// 9 - 친구 관리

	std::string szInventory;			// 10
	std::string szTransaction;			// 11
	std::string szDroppedItem;			// 12

	std::string szTargetBar;			// 13
	std::string szTargetSymbolShape;	// 14
	std::string szSkillTree;			// 15
	std::string szHotKey;				// 16

	std::string szMiniMap;				// 17
	std::string szPartyOrForce;			// 18
	std::string szPartyBBS;				// 19

	std::string szHelp;					// 20
	std::string szNotice;				// 21

	std::string szCharacterCreate;		// 22
	std::string szCharacterSelect;		// 23

	std::string szToolTip;				// 24
	std::string szMessageBox;			// 25
	std::string szLoading;				// 26
	std::string szItemInfo;				// 27
	std::string szPersonalTrade;		// 28
	std::string szPersonalTradeEdit;	// 29

	std::string szNpcEvent;				// 30
	std::string szZoneChangeOrWarp;		// 31
	std::string szExchangeRepair;		// 32

	std::string szRepairTooltip;		// 33
	std::string szNpcTalk;				// 34
	std::string szNpcExchangeList;		// 35

	std::string szKnightsOperation;		// 36
	std::string szClassChange;			// 37

	std::string szEndingDisplay;		// 38
	std::string szWareHouse;			// 39

	std::string szChangeClassInit;		// 40
	std::string szChangeInitBill;		// 41

	std::string szInn;					// 42
	std::string szInputClanName;		// 43
	std::string szTradeBBS;				// 44
	std::string szTradeBBSSelector;		// 45
	std::string szTradeExplanation;		// 46
	std::string szTradeMemolist;		// 47
	std::string szQuestMenu;			// 48
	std::string szQuestTalk;			// 49
	std::string szDead;					// 50
	std::string szElLoading;			// 51
	std::string szKaLoading;			// 52
	std::string szNationSelect;			// 53

} TABLE_UI_RESRC;

typedef struct __TABLE_ITEM_BASIC // 장착 아이템에 관한 리소스 레코드...
{
	DWORD		dwID;				// 00 코드화된 아이템번호 d - // 00 - Item 종류, 00 - Item 장착 위치(장착위치로 Plug 인지 Part 인지 판단이 가능하다.) - 0000 - ItemIndex
	BYTE 		byExtIndex;			// 01 확장 인덱스
	std::string	szName;				// 02 이름	
	std::string	szRemark;			// 03 아이템 설명	
	DWORD		dwIDResrc;			// 04 코드화된 아이템 리소스	d
	DWORD		dwIDIcon;			// 05 코드화된 아이템 아이콘 리소스	d
	DWORD		dwSoundID0;			// 06 Sound ID - 0 이면 사운드 없다~..
	DWORD		dwSoundID1;			// 07 Sound ID - 0 이면 사운드 없다~..

	BYTE	byClass;			// 08 아이템 형태	b enum e_ItemClass 참조....
	BYTE	byIsRobeType;		// 09 위아래가 통째로 된 로브타입의 아이템.....
	BYTE	byAttachPoint;		// 10 장착 위치	b
	BYTE	byNeedRace;			// 11 종족	b
	BYTE	byNeedClass;		// 12 직업	b

	short	siDamage;			// 13 무기타격	b
	short	siAttackInterval;	// 14 공격 시간 100 은 1 초
	short	siAttackRange;		// 15 유효 거리	.1 meter 단위
	short	siWeight;			// 16 무게 .1 중량단위
	short	siMaxDurability;	// 17 내구력
	int		iPrice;				// 18 매수가
